study12/tools/loadtest/results/study11_baseline__post-counter-interference-comments100__comment-smoke__20260730-155857__k6-console.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/post-counter-interference.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 40s max duration (incl. graceful stop):
              * comment_lifecycle: 1 iterations shared among 1 VUs (maxDuration: 10s, exec: commentLifecycle, gracefulStop: 30s)



  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    comment_lifecycle_failed
    ✓ 'rate<0.01' rate=0.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 2       19.26166/s
    checks_succeeded...: 100.00% 2 out of 2
    checks_failed......: 0.00%   0 out of 2

    ✓ comment create status is 201
    ✓ comment delete status is 204

    CUSTOM
    comment_create_duration........: avg=23.76ms  min=23.76ms  med=23.76ms  p(90)=23.76ms  p(95)=23.76ms  p(99)=23.76ms  max=23.76ms 
    comment_create_status_201......: 1     9.63083/s
    comment_delete_duration........: avg=77.67ms  min=77.67ms  med=77.67ms  p(90)=77.67ms  p(95)=77.67ms  p(99)=77.67ms  max=77.67ms 
    comment_delete_status_204......: 1     9.63083/s
    comment_lifecycle_duration.....: avg=103ms    min=103ms    med=103ms    p(90)=103ms    p(95)=103ms    p(99)=103ms    max=103ms   
    comment_lifecycle_failed.......: 0.00% 0 out of 1

    HTTP
    http_req_duration..............: avg=50.71ms  min=23.76ms  med=50.71ms  p(90)=72.28ms  p(95)=74.98ms  p(99)=77.13ms  max=77.67ms 
      { expected_response:true }...: avg=50.71ms  min=23.76ms  med=50.71ms  p(90)=72.28ms  p(95)=74.98ms  p(99)=77.13ms  max=77.67ms 
    http_req_failed................: 0.00% 0 out of 2
    http_reqs......................: 2     19.26166/s

    EXECUTION
    iteration_duration.............: avg=103.74ms min=103.74ms med=103.74ms p(90)=103.74ms p(95)=103.74ms p(99)=103.74ms max=103.74ms
    iterations.....................: 1     9.63083/s

    NETWORK
    data_received..................: 900 B 8.7 kB/s
    data_sent......................: 743 B 7.2 kB/s



running (00.1s), 0/1 VUs, 1 complete and 0 interrupted iterations
comment_lifecycle ✓ [ 100% ] 1 VUs  00.1s/10s  1/1 shared iters